In [1]:
import pandas as pd
import numpy as np

In [3]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'Manual', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'Automatic', 'Sedan', 271500],
    ['Lotus', 'Elise', 2010, 218, 4, 'Manual', 'convertible', 54990],
    ['GMC', 'Acadia', 2017, 194, 4, 'Automatic', '4dr SUV', 34450],
    ['Nisssan', 'Frontier', 2017, 261, 6, 'Manual', 'Pickup', 32340],
]

In [4]:
columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders', 'Transmission Type', 'Vehicle Style', 'MSRP'
]

In [6]:
df = pd.DataFrame(data, columns = columns)
df.head()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP
0,Nissan,Stanza,1991,138.0,4,Manual,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,Automatic,Sedan,271500
2,Lotus,Elise,2010,218.0,4,Manual,convertible,54990
3,GMC,Acadia,2017,194.0,4,Automatic,4dr SUV,34450
4,Nisssan,Frontier,2017,261.0,6,Manual,Pickup,32340

In [7]:
df['id'] = [1,2,3,4,5]

In [8]:
del df['id']

In [9]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
df.iloc[[0,2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP
0,Nissan,Stanza,1991,138.0,4,Manual,sedan,2000
2,Lotus,Elise,2010,218.0,4,Manual,convertible,54990

### Element-wise operations

In [15]:
df['Engine HP'] / 100

0    1.38
1     NaN
2    2.18
3    1.94
4    2.61
Name: Engine HP, dtype: float64

In [16]:
df[df['Year'] >= 2015]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,Automatic,Sedan,271500
3,GMC,Acadia,2017,194.0,4,Automatic,4dr SUV,34450
4,Nisssan,Frontier,2017,261.0,6,Manual,Pickup,32340

### String operations

In [19]:
df['Vehicle Style'].str.lower()

0          sedan
1          sedan
2    convertible
3        4dr suv
4         pickup
Name: Vehicle Style, dtype: object

In [21]:
df.nunique()

Make                 5
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle Style        5
MSRP                 5
dtype: int64

In [25]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle Style        0
MSRP                 0
dtype: int64

In [28]:
df.groupby('Transmission Type')['MSRP'].mean()

Transmission Type
Automatic    152975.000000
Manual        29776.666667
Name: MSRP, dtype: float64

In [31]:
df.to_dict(orient='record')

/tmp/ipykernel_392155/3088872241.py:1: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  df.to_dict(orient='record')

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'Manual',
  'Vehicle Style': 'sedan',
  'MSRP': 2000},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'Automatic',
  'Vehicle Style': 'Sedan',
  'MSRP': 271500},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'Manual',
  'Vehicle Style': 'convertible',
  'MSRP': 54990},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'Automatic',
  'Vehicle Style': '4dr SUV',
  'MSRP': 34450},
 {'Make': 'Nisssan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'Manual',
  'Vehicle Style': 'Pickup',
  'MSRP': 32340}]